<a href="https://colab.research.google.com/github/sbbwoy/ESAA/blob/main/grouping_occupation_Exercise.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Occupation

### Introduction:

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [15]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users.

In [17]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
users = pd.read_csv(url,sep='|',index_col='user_id')
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

### Step 4. Discover what is the mean age per occupation

In [ ]:
users_groupby = users.groupby('occupation')['age'].mean()
users_groupby

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [ ]:
def gender2num(x):
    if x == 'M':
        return 1
    if x == 'F':
        return 0 
    
    
users['gender_n'] = users['gender'].apply(gender2num)

a = users.groupby('occupation')['gender_n'].sum() / users.occupation.value_counts() * 100

a.sort_values(ascending=False)

### Step 6. For each occupation, calculate the minimum and maximum ages

In [24]:
users.groupby('occupation').agg([min, max])

              age     gender     zip_code        gender_n
              min max    min max      min    max      min max
occupation
administrator  21  70      F   M    02154  V1G4L        0   1
artist         19  48      F   M    01945  V5A2B        0   1
doctor         28  64      M   M    47401  97405        1   1
educator       23  63      F   M    01602  M4J2K        0   1
engineer       22  70      F   M    00000  T8H1N        0   1
entertainment  15  50      F   M    01040  V3N4P        0   1
executive      22  69      F   M    00000  L1V3W        0   1
healthcare     22  62      F   M    02154  97232        0   1
homemaker      20  50      F   M    17331  96349        0   1
lawyer         21  53      F   M    06371  90703        0   1
librarian      23  69      F   M    01080  99603        0   1
marketing      24  55      F   M    01913  97215        0   1
none           11  55      F   M    21206  94619        0   1
other          13  64      F   M    02110  V0R2M        0   1
programmer     20  63      F   M    01331  98121        0   1
retired        51  73      F   M    02903  98257        0   1
salesman       18  66      F   M    30011  97408        0   1
scientist      23  55      F   M    02113  T8H1N        0   1
student         7  42      F   M    01002  R3T5K        0   1
technician     21  55      F   M    02139  Y1A6B        0   1
writer         18  60      F   M    08534  E2A4H        0   1

### Step 7. For each combination of occupation and gender, calculate the mean age

In [25]:
users.groupby(['occupation', 'gender'])['age'].mean()

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

### Step 8.  For each occupation present the percentage of women and men

In [32]:
a = users.groupby(['occupation', 'gender'])['gender'].count()
b = users.groupby(['occupation']).gender.count()
c = a/b*100
c

occupation     gender
administrator  F          45.569620
               M          54.430380
artist         F          46.428571
               M          53.571429
doctor         M         100.000000
educator       F          27.368421
               M          72.631579
engineer       F           2.985075
               M          97.014925
entertainment  F          11.111111
               M          88.888889
executive      F           9.375000
               M          90.625000
healthcare     F          68.750000
               M          31.250000
homemaker      F          85.714286
               M          14.285714
lawyer         F          16.666667
               M          83.333333
librarian      F          56.862745
               M          43.137255
marketing      F          38.461538
               M          61.538462
none           F          44.444444
               M          55.555556
other          F          34.285714
               M          65.714286
programmer     F           9.090909
               M          90.909091
retired        F           7.142857
               M          92.857143
salesman       F          25.000000
               M          75.000000
scientist      F           9.677419
               M          90.322581
student        F          30.612245
               M          69.387755
technician     F           3.703704
               M          96.296296
writer         F          42.222222
               M          57.777778
Name: gender, dtype: float64